ErpTest/src/InformationRegisters/уатАналогиГСМ/уатАналогиГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатАналогиГСМ</name>
  <comment>(уат)</comment>
  <dimensions>
    <name>ГСМ</name>
    <comment>ГСМ</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналог</name>
    <comment>Аналог</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/уатНоменклатураГСМ/уатНоменклатураГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатНоменклатураГСМ</name>
  <comment>Доп. сведения для ГСМ</comment>
  <resources>
    <name>ВестиУчетОстатковТЖ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаГСМ</name>
    <type>
      <types>EnumRef.уатГруппыГСМ</types>
    </type>
  </resources>
  <resources>
    <name>ГСМТалона</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ЛитровыйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НоминалТалона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/уатАналогиГСМ/Forms/ФормаЗаписи/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьЗначениеГСМ(ТекГСМ)
	СтруктураГСМ = РегистрыСведений.уатНоменклатураГСМ.Получить(Новый Структура("Номенклатура", ТекГСМ));
	Возврат СтруктураГСМ;
КонецФункции

&НаКлиенте
Процедура ГСМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДопПараметры = Новый Структура("ЗначениеГСМДоИзменения, ИмяПроцедурыОписаниеОповещения", Запись.ГСМ, "ОписаниеОповещенияВыбораГСМ");
	уатЗащищенныеФункцииКлиент.ВыбратьГСМ(, ЭтаФорма, ДопПараметры);
КонецПроцедуры

// Подключаемый динамически обработчик оповещения
&НаКлиенте
Процедура ОписаниеОповещенияВыбораГСМ(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Запись.ГСМ = Результат;
		Если Запись.ГСМ <> ДопПараметры.ЗначениеГСМДоИзменения Тогда 
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АналогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекСтруктураГСМ = ПолучитьЗначениеГСМ(Запись.ГСМ);
	
	ДопПараметры = Новый Структура("ЗначениеГСМДоИзменения, ИмяПроцедурыОписаниеОповещения", Запись.Аналог, "ОписаниеОповещенияВыборАналогаГСМ");
	
	Если ЗначениеЗаполнено(ТекСтруктураГСМ.ГруппаГСМ) Тогда
		уатЗащищенныеФункцииКлиент.ВыбратьГСМ(ТекСтруктураГСМ.ГруппаГСМ, ЭтаФорма, ДопПараметры);
	Иначе
		уатЗащищенныеФункцииКлиент.ВыбратьГСМ(, ЭтаФорма, ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Подключаемый динамически обработчик оповещения
&НаКлиенте
Процедура ОписаниеОповещенияВыборАналогаГСМ(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Запись.Аналог = Результат;
		Если Запись.Аналог <> ДопПараметры.ЗначениеГСМДоИзменения Тогда 
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//уатЗащищенныеФункцииСервер.уатРегистрФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка,ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//уатЗащищенныеФункцииКлиент.уатРегистрФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
